groupmates = [
{
"name": "Александр",
"surname": "Иванов",
"exams": ["Информатика", "ЭЭиС", "Web"],
"marks": [4, 3, 5]
},
{
"name": "Иван",
"surname": "Петров",
"exams": ["История", "АиГ", "КТП"],
"marks": [4, 4, 4]
},
{
"name": "Кирилл",
"surname": "Смирнов",
"exams": ["Философия", "ИС", "КТП"],
"marks": [5, 5, 5]
},
{
"name": "Екатерина",
"surname": "Сидорова",
"exams": ["Физика", "ЭЭиС", "КТП"],
"marks": [4, 5, 4]
},
{
"name": "Дмитрий",
"surname": "Козлов",
"exams": ["Иностранный язык", "Математика", "Web"],
"marks": [5, 5, 3]
},
{
"name": "Ольга",
"surname": "Новикова",
"exams": ["Философия", "Экономика", "АиГ"],
"marks": [4, 4, 5]
},
{
"name": "Андрей",
"surname": "Кузнецов",
"exams": ["История", "ИС", "КТП"],
"marks": [3, 4, 4]
}
]


